samdonnelly/STM32F4-driver-test/sources/device_test/nrf24l01_test.c
    // Power up the device now that it is configured 
    nrf24l01_init_status |= nrf24l01_pwr_up(); 

    // Check init status 
    if (nrf24l01_init_status)
    {
        uart_send_str(USART2, "nRF24L01 init failed."); 
        while(1); 
    }
    else 
    {
        uart_send_str(USART2, "nRF24L01 init success."); 
    }

    //==================================================

#if NRF24L01_HEARTBEAT 
    nrf24l01_heartbeat_test_init(); 
#elif NRF24L01_MANUAL_CONTROL 
    nrf24l01_manual_control_test_init(); 
#endif 
}

//=======================================================================================


//=======================================================================================
// Test code 

void nrf24l01_test_app(void)
{
#if NRF24L01_HEARTBEAT 
    nrf24l01_heartbeat_test_loop(); 
#elif NRF24L01_MANUAL_CONTROL 
    nrf24l01_manual_control_test_loop(); 
#endif 
}

//=======================================================================================


#if NRF24L01_HEARTBEAT 

//=======================================================================================
// Heartbeat test 

// Description 
// - Device 1 (master) sends a 'ping' to device 2 (slave) periodically 
// - Device 2 reads ping and responds with a confirmation 
// - Device 1 reads confirmation to verify communication is working 
// - If device 1 doesn't get a response then indicate a loss of communication 
// - Option to enter a "configuration" mode (on both devices) where settings can be 
//   manually changed by the user. Can then switch back to heartbeat mode to make sure 
//   there is still communication. 

//==================================================
// Macros 

#define HB_PERIOD 50000             // Time between checking for new data (us) 
#define HB_SEND_TIMER 40            // Counter to control message send frequency 

#define HB_LETTER_O 0x6F            // ASCII for lowercase "o" 
#define HB_EXCLAMATION 0x21         // ASCII for "!" 

//==================================================


//==================================================
// Variables 

#if NRF24L01_SYSTEM_1 

static const char 
hb_message[] = "ping%u", 
hb_response[] = "pong%u!"; 

#elif NRF24L01_SYSTEM_2 
#endif 

// Device tracker data record 
typedef struct hb_test_trackers_s 
{
    uint8_t send_timer; 
    uint8_t msg_counter; 

    char hb_msg[NRF24L01_MAX_PAYLOAD_LEN]; 
    char hb_res[NRF24L01_MAX_PAYLOAD_LEN]; 

    gpio_pin_state_t led_state; 
}
hb_test_trackers_t; 

// Device tracker instance 
static hb_test_trackers_t hb_test; 

//==================================================


//==================================================
// Setup 

void nrf24l01_heartbeat_test_init(void)
{
    hb_test.send_timer = CLEAR; 
    hb_test.msg_counter = CLEAR; 
    memset((void *)hb_test.hb_msg, CLEAR, sizeof(hb_test.hb_msg)); 
    memset((void *)hb_test.hb_res, CLEAR, sizeof(hb_test.hb_res)); 
    hb_test.led_state = GPIO_LOW; 

#if NRF24L01_SYSTEM_1 

    snprintf(hb_test.hb_msg, NRF24L01_MAX_PAYLOAD_LEN, hb_message, hb_test.msg_counter); 
    snprintf(hb_test.hb_res, NRF24L01_MAX_PAYLOAD_LEN, hb_response, hb_test.msg_counter); 

#elif NRF24L01_SYSTEM_2 
#endif 
}

//==================================================


//==================================================
// Loop 

void nrf24l01_heartbeat_test_loop(void)
{
    // Periodically check for action items 
    if (tim_compare(nrf24l01_test.timer_nonblocking, 
                    nrf24l01_test.delay_timer.clk_freq, 
                    HB_PERIOD, 
                    &nrf24l01_test.delay_timer.time_cnt_total, 
                    &nrf24l01_test.delay_timer.time_cnt, 
                    &nrf24l01_test.delay_timer.time_start))
    {
        // time_start flag does not need to be set again because this timer runs 
        // continuously. 

#if NRF24L01_SYSTEM_1 

        // Send heartbeat message periodically 
        if (!hb_test.send_timer++)
        {
            if (nrf24l01_send_payload((uint8_t *)hb_test.hb_msg) == NRF24L01_OK)
            {
                // Toggle the board LED 
                hb_test.led_state = GPIO_HIGH - hb_test.led_state; 
                gpio_write(GPIOA, GPIOX_PIN_5, hb_test.led_state); 

                // Show the heartbeat message 
                uart_send_new_line(USART2); 
                uart_send_str(USART2, hb_test.hb_msg); 
                uart_send_str(USART2, "... "); 
            }
        }

        if (hb_test.send_timer > HB_SEND_TIMER)
        {
            hb_test.send_timer = CLEAR; 
        }

        // Look for a heartbeat response 
        if (nrf24l01_data_ready_status() == nrf24l01_test.pipe)
        {
            nrf24l01_receive_payload(nrf24l01_test.read_buff); 

            // Check if the received message is the one we need 
            if (!strcmp((char *)nrf24l01_test.read_buff, hb_test.hb_res))
            {
                // Display the response and update the heatbeat message and response 
                uart_send_str(USART2, (char *)nrf24l01_test.read_buff); 
                hb_test.msg_counter++; 
                snprintf(hb_test.hb_msg, NRF24L01_MAX_PAYLOAD_LEN, 
                         hb_message, hb_test.msg_counter); 
                snprintf(hb_test.hb_res, NRF24L01_MAX_PAYLOAD_LEN, 
                         hb_response, hb_test.msg_counter); 
            }
        }

#elif NRF24L01_SYSTEM_2 

        // Look for a heartbeat message 
        if (nrf24l01_data_ready_status() == nrf24l01_test.pipe)
        {
            nrf24l01_receive_payload(nrf24l01_test.read_buff); 

            // Modify the received message to get the desired response (changes "ping#" 
            // to "pong#!"). Note that the contents of the received message is not 
            // checked on purpose as it's not necessary for this test. 
            uint8_t msg_index = 1; 
            nrf24l01_test.read_buff[msg_index] = HB_LETTER_O; 
            
            while (nrf24l01_test.read_buff[msg_index] != NULL_CHAR) 
            {
                msg_index++; 
            }

