samdonnelly/STM32F4-driver-test/sources/device_test/nrf24l01_test.c
            nrf24l01_test.read_buff[msg_index] = HB_EXCLAMATION; 
            nrf24l01_test.read_buff[++msg_index] = NULL_CHAR; 

            // Send the response back 
            nrf24l01_send_payload(nrf24l01_test.read_buff); 
        }

#endif 
    }
}

//==================================================

//=======================================================================================


#elif NRF24L01_MANUAL_CONTROL 

//=======================================================================================
// Manual control test 

// Description 
// - System 1: 
//   - Looks for user input at the serial terminal. If there is an input then try to 
//     match it to one of the pre-defined commands. If a command is matched then execute 
//     the command callback. If not then do nothing. 
//   - Commands are used to change device settings and ping the second system. 
//   - Periodically looks for a message from the second system. The second system will 
//     only send a message when responding to a ping. 
// - System 2: 
//   - Periodically check for a ping message from system 1. If a message is received then 
//     the message is checked to see if it matches the ping message. If there is a match 
//     then a response is sent. 

//==================================================
// Macros 

#define MC_PERIOD 50000   // Time between checking for new data (us) 

//==================================================


//==================================================
// Prototypes 

/**
 * @brief Send a ping and output the send operation status to the serial terminal 
 * 
 * @param arg_value : argument is not used 
 * @param arg_str : argument is not used 
 */
void nrf24l01_test_send_ping(
    uint8_t arg, 
    uint8_t *arg_str); 


/**
 * @brief RF channel set command 
 * 
 * @details "channel" command callback function. The value from the command updates the 
 *          RF channel that the device operates on but only if it's within range of the 
 *          available channels (0-125 MHz (input) + 2400 MHz). A value out of range will 
 *          not update the device. The status of the request is output for the user. 
 * 
 * @param rf_ch : RF channel to set the device to (0-125) 
 * @param arg_str : argument is not used 
 */
void nrf24l01_test_set_rf_ch(
    uint8_t rf_ch, 
    uint8_t *arg_str); 


/**
 * @brief RF data rate set command 
 * 
 * @details "data_rate" command callback function. The value from the command updates the 
 *          RF data rate that the device uses but only if it's within range of the 
 *          available data rates (see nrf24l01_data_rate_t). A value out of range will 
 *          not update the device. The status of the request is output for the user. 
 * 
 * @see nrf24l01_data_rate_t 
 * 
 * @param rf_dr : data rate to set the device to 
 * @param arg_str : argument is not used 
 */
void nrf24l01_test_set_rf_dr(
    uint8_t rf_dr, 
    uint8_t *arg_str); 


/**
 * @brief RF power output set command 
 * 
 * @details "power" command callback function. The value from the command updates the 
 *          devices' power ouput but only if it's within range of the available power 
 *          levels (see nrf24l01_rf_pwr_t). A value out of range will not update the 
 *          device. The status of the request is output for the user. 
 * 
 * @see nrf24l01_rf_pwr_t 
 * 
 * @param rf_pwr : power output to set the device to 
 * @param arg_str : argument is not used 
 */
void nrf24l01_test_set_rf_pwr(
    uint8_t rf_pwr, 
    uint8_t *arg_str); 


/**
 * @brief Choose which update message to display 
 * 
 * @param status : setting update status 
 */
void nrf24l01_test_update_feedback(uint8_t status); 


/**
 * @brief Display a message for the user in the serial terminal 
 */
void nrf24l01_test_user_feedback(const char *user_msg); 

//==================================================


//==================================================
// Variables 

// Messages sent between system 
static const char 
ping_msg[] = "ping",   // Doubles as a user command 
ping_res[] = "pong"; 


#if NRF24L01_SYSTEM_1 

// User commands and feedback 
static const char 
set_ch[] = "channel", 
set_dr[] = "data_rate", 
set_pwr[] = "power", 
update_success[] = "Success.", 
update_failed[] = "Failed.", 
invalid_value[] = "Invalid command value.", 
ping_failed[] = "Ping failed to send."; 

// Command table 
static const nrf24l01_cmds_t mc_cmd_table[NUM_USER_CMDS] = 
{
    {ping_msg, &nrf24l01_test_send_ping}, 
    {set_ch,   &nrf24l01_test_set_rf_ch}, 
    {set_dr,   &nrf24l01_test_set_rf_dr}, 
    {set_pwr,  &nrf24l01_test_set_rf_pwr} 
}; 

// Command data 
static nrf24l01_cmd_data_t mc_cmd_data; 

#endif 

//==================================================


//==================================================
// Setup 

void nrf24l01_manual_control_test_init(void)
{
#if NRF24L01_SYSTEM_1 

    //==================================================
    // UART DMA - further configure the UART for DMA input 

    // Enable the IDLE line interrupt 
    uart_interrupt_init(
        USART2, 
        UART_PARAM_DISABLE, 
        UART_PARAM_DISABLE, 
        UART_PARAM_DISABLE, 
        UART_PARAM_DISABLE, 
        UART_PARAM_ENABLE, 
        UART_PARAM_DISABLE, 
        UART_PARAM_DISABLE); 

    // Initialize the DMA stream for the UART 
    dma_stream_init(
        DMA1, 
        DMA1_Stream5, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_VHI, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

    // Configure the DMA stream for the UART 
    dma_stream_config(
        DMA1_Stream5, 
        (uint32_t)(&USART2->DR), 
        (uint32_t)mc_cmd_data.cb, 
        (uint16_t)NRF24L01_TEST_MAX_INPUT); 

    // Enable the DMA stream for the UART 
    dma_stream_enable(DMA1_Stream5); 

    // Initialize interrupt handler flags (called once) 
    int_handler_init(); 

    // Enable the interrupt handlers (called for each interrupt) - for USART2_RX 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_0); 

    //==================================================

    //==================================================
    // Initialize data 

    mc_cmd_data.uart = USART2; 
    mc_cmd_data.dma_stream = DMA1_Stream5; 
    memset((void *)mc_cmd_data.cb, CLEAR, sizeof(mc_cmd_data.cb)); 
    mc_cmd_data.cb_index.cb_size = NRF24L01_TEST_MAX_INPUT; 
    mc_cmd_data.cb_index.head = CLEAR; 
    mc_cmd_data.cb_index.tail = CLEAR; 
    mc_cmd_data.dma_index.data_size = CLEAR; 
    mc_cmd_data.dma_index.ndt_old = dma_ndt_read(mc_cmd_data.dma_stream); 
    mc_cmd_data.dma_index.ndt_new = CLEAR; 
    memset((void *)mc_cmd_data.data_buff, CLEAR, sizeof(mc_cmd_data.data_buff)); 

