samdonnelly/STM32F4-driver-test/sources/device_test/nrf24l01_test.c
    memset((void *)mc_cmd_data.cmd_id, CLEAR, sizeof(mc_cmd_data.cmd_id)); 
    mc_cmd_data.cmd_value = CLEAR; 
    memset((void *)mc_cmd_data.cmd_str, CLEAR, sizeof(mc_cmd_data.cmd_str)); 
    
    //==================================================

    nrf24l01_test_user_prompt(); 
    
#elif NRF24L01_SYSTEM_2 
#endif 
}

//==================================================


//==================================================
// Loop 

void nrf24l01_manual_control_test_loop(void)
{
#if NRF24L01_SYSTEM_1 

    // Check for user input 
    nrf24l01_test_user_input(&mc_cmd_data, mc_cmd_table, NUM_USER_CMDS, NRF24L01_CMD_ARG_VALUE); 
    
#endif 

    // Periodically check for action items 
    if (tim_compare(nrf24l01_test.timer_nonblocking, 
                    nrf24l01_test.delay_timer.clk_freq, 
                    MC_PERIOD, 
                    &nrf24l01_test.delay_timer.time_cnt_total, 
                    &nrf24l01_test.delay_timer.time_cnt, 
                    &nrf24l01_test.delay_timer.time_start))
    {
        // time_start flag does not need to be set again because this timer runs 
        // continuously. 

        // Look for a heartbeat message 
        if (nrf24l01_data_ready_status() == nrf24l01_test.pipe)
        {
            nrf24l01_receive_payload(nrf24l01_test.read_buff); 

#if NRF24L01_SYSTEM_1 

            // If a ping response message is seen then display the response 
            if (!strcmp(ping_res, (char *)nrf24l01_test.read_buff))
            {
                nrf24l01_test_user_feedback("\033[1A\033[1A\r"); 
                nrf24l01_test_user_feedback(ping_msg); 
                nrf24l01_test_user_feedback("..."); 
                nrf24l01_test_user_feedback(ping_res); 
                nrf24l01_test_user_prompt(); 
            }

#elif NRF24L01_SYSTEM_2 

            // If a ping message is seen then send a response back 
            if (!strcmp(ping_msg, (char *)nrf24l01_test.read_buff))
            {
                nrf24l01_send_payload((uint8_t *)ping_res);     
            }
#endif 
        }
    }
}

//==================================================


//==================================================
// Test functions 

#if NRF24L01_SYSTEM_1 

// PRX device connection status 
void nrf24l01_test_send_ping(
    uint8_t arg_value, 
    uint8_t *arg_str)
{
    if (nrf24l01_send_payload((uint8_t *)ping_msg) == NRF24L01_OK)
    {
        nrf24l01_test_user_feedback(ping_msg); 
        nrf24l01_test_user_feedback("..."); 
    }
    else 
    {
        nrf24l01_test_user_feedback(ping_failed); 
    }
}


// RF channel set callback 
void nrf24l01_test_set_rf_ch(
    uint8_t rf_ch, 
    uint8_t *arg_str)
{
    if (rf_ch <= NRF24L01_RF_CH_MAX)
    {
        nrf24l01_set_rf_ch(rf_ch); 
        nrf24l01_rf_ch_write(); 
        
        nrf24l01_rf_ch_read(); 
        nrf24l01_test_update_feedback(nrf24l01_get_rf_ch() == rf_ch); 
    }
    else 
    {
        nrf24l01_test_user_feedback(invalid_value); 
    }
}


// RF data rate set callback 
void nrf24l01_test_set_rf_dr(
    uint8_t rf_dr, 
    uint8_t *arg_str)
{
    if (rf_dr <= (uint8_t)NRF24L01_DR_250KBPS)
    {
        nrf24l01_set_rf_setup_dr((nrf24l01_data_rate_t)rf_dr); 
        nrf24l01_rf_setup_write(); 

        nrf24l01_rf_setup_read(); 
        nrf24l01_test_update_feedback(
            nrf24l01_get_rf_setup_dr() == (nrf24l01_data_rate_t)rf_dr); 
    }
    else 
    {
        nrf24l01_test_user_feedback(invalid_value); 
    }
}


// RF power output set callback 
void nrf24l01_test_set_rf_pwr(
    uint8_t rf_pwr, 
    uint8_t *arg_str)
{
    if (rf_pwr <= (uint8_t)NRF24L01_RF_PWR_0DBM)
    {
        nrf24l01_set_rf_setup_pwr((nrf24l01_rf_pwr_t)rf_pwr); 
        nrf24l01_rf_setup_write(); 

        nrf24l01_rf_setup_read(); 
        nrf24l01_test_update_feedback(
            nrf24l01_get_rf_setup_pwr() == (nrf24l01_rf_pwr_t)rf_pwr); 
    }
    else 
    {
        nrf24l01_test_user_feedback(invalid_value); 
    }
}


// Choose which update message to display 
void nrf24l01_test_update_feedback(uint8_t status)
{
    status ? nrf24l01_test_user_feedback(update_success) : 
             nrf24l01_test_user_feedback(update_failed); 
}


// Display a message for the user in the serial terminal 
void nrf24l01_test_user_feedback(const char *user_msg)
{
    uart_send_str(USART2, user_msg); 
}

#endif 

//==================================================

//=======================================================================================

#endif 


//=======================================================================================
// Test functions 

// User terminal prompt 
void nrf24l01_test_user_prompt(void)
{
    uart_send_str(USART2, "\r\n\n>>> "); 
}


// Check for user input and execute callbacks if a valid command arrives 
void nrf24l01_test_user_input(
    nrf24l01_cmd_data_t *cmd_data, 
    const nrf24l01_cmds_t *cmd_table, 
    uint8_t num_cmds, 
    nrf24l01_cmd_arg_t cmd_arg_type)
{
    // Check for user serial terminal input 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR; 

        // Copy the new contents in the circular buffer to the user input buffer 
        dma_cb_index(cmd_data->dma_stream, &cmd_data->dma_index, &cmd_data->cb_index); 
        cb_parse(cmd_data->cb, &cmd_data->cb_index, cmd_data->data_buff); 

        // Validate the input - parse into an ID and value if valid 
        if (nrf24l01_test_parse_cmd(cmd_data, cmd_arg_type))
        {
            // Valid input - compare the ID to each of the available pre-defined commands 
            for (uint8_t i = CLEAR; i < num_cmds; i++) 
            {
                if (!strcmp(cmd_table[i].user_cmds, (char *)cmd_data->cmd_id))
                {
                    // ID matched to a command. Execute the command. 
                    (cmd_table[i].cmd_ptr)(cmd_data->cmd_value, cmd_data->cmd_str); 
                    break; 
                }
            }
        }

        nrf24l01_test_user_prompt(); 
    }
}


// Parse the user input into an ID (command) and value 
uint8_t nrf24l01_test_parse_cmd(
    nrf24l01_cmd_data_t *cmd_data, 
    nrf24l01_cmd_arg_t cmd_arg_type)
{
    nrf24l01_cmd_arg_t cmd_arg_flag = NRF24L01_CMD_ARG_NONE; 
    uint8_t id_index = CLEAR; 
    uint8_t data = cmd_data->data_buff[0]; 
    uint8_t cmd_value[NRF24L01_TEST_MAX_INPUT]; 
    uint8_t value_size = CLEAR; 

    // Initialize data 
    memset((void *)cmd_data->cmd_id, CLEAR, sizeof(cmd_data->cmd_id)); 
    cmd_data->cmd_value = CLEAR; 
    memset((void *)cmd_data->cmd_str, CLEAR, sizeof(cmd_data->cmd_str)); 
    memset((void *)cmd_value, CLEAR, sizeof(cmd_value)); 

    // Parse the command into an ID and value 
    for (uint8_t i = CLEAR; data != NULL_CHAR; i++)
    {
        switch (cmd_arg_flag)
        {
            case NRF24L01_CMD_ARG_NONE:   // Command ID parsing 

