samdonnelly/STM32F4-driver-test/sources/device_test/nrf24l01_test.c
                // Check that the command byte is within range 
                if ((data >= A_LO_CHAR && data <= Z_LO_CHAR) || 
                    (data >= A_UP_CHAR && data <= Z_UP_CHAR) || 
                    (data >= ZERO_CHAR && data <= NINE_CHAR) || 
                    (data == UNDERSCORE_CHAR))
                {
                    // Valid character byte seen 
                    cmd_data->cmd_id[i] = data; 
                }
                else if (data == SPACE_CHAR)
                {
                    // End of ID, start of optional value 
                    cmd_arg_flag = cmd_arg_type; 
                    cmd_data->cmd_id[i] = NULL_CHAR; 
                    id_index = i + 1; 
                }
                else 
                {
                    // Valid data not seen 
                    return FALSE; 
                }

                break; 

            case NRF24L01_CMD_ARG_VALUE:   // Command value parsing 

                if (data >= ZERO_CHAR && data <= NINE_CHAR)
                {
                    // Valid digit character byte seen 
                    cmd_value[i-id_index] = data; 
                    value_size++; 
                }
                else 
                {
                    // Valid data not seen 
                    return FALSE; 
                }

                break; 

            case NRF24L01_CMD_ARG_STR:   // Command string parsing 
                cmd_data->cmd_str[i-id_index] = data; 
                break; 

            default: 
                break; 
        }

        data = cmd_data->data_buff[i+1]; 
    }

    // Calculate the cmd value 
    for (uint8_t i = CLEAR; i < value_size; i++)
    {
        cmd_data->cmd_value += (uint8_t)char_to_int(cmd_value[i], value_size-i-1); 
    }

    return TRUE; 
}

//=======================================================================================
